universitysjp/visakha-lamp/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# ---- smaller binary ----------------------------------------------------------
# -Os instead of the default -Og, and assertions without their message strings.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
# Drops the esp_err_t -> name string table.
CONFIG_ESP_ERR_TO_NAME_LOOKUP=n
# Compile out DEBUG/INFO log strings; the firmware logs its status at WARN level.
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL=2

# ---- Wi-Fi features this panel never uses ------------------------------------
# It is a WPA2-PSK access point: no WPA3-SAE, no OWE, no enterprise/EAP, no
# Ethernet. Turning the WPA3-Personal code off is most of the saving, since the
# WPA2 path does not use it.
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_SOFTAP=n
CONFIG_ESP_WIFI_WPA3_COMPATIBLE_SUPPORT=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_ESP_WIFI_GMAC_SUPPORT=n
